fib:
	addiu	$10 $zero 0	s=0 // 解
	addiu	$11 $zero 1	a=1	// 1個前
	addiu	$12 $zero 0	b=0	// temp
	addiu	$13 $zero 0	i=0
loop:	iがt4以下の間ループする
	slt	$14 $13 $a0	(if i<a0 then t=1)
	beq	$14 $zero exit	(if t=0 then goto line(15))
	addiu	$12 $11 0		a = b+0
	addu	$11 $10 $11	a = s+a
	addiu	$10 $12 0		b = s+0
	addiu	$13 $13 1		i++
	j	loop				goto "loop"
exit:
	addiu	$v0 $12 0		return b

addiu:001001
addu:00000000000000000000000000100001
addu rs,rt,rd -> rd=rs+rt
slt:00000000000000000000000000101010
beq:000100
j:000010

funct:00000000000000000000000000

$r10-r19:	01100-10011
$zero:		00000
$v0:		00010

im:
0	0000000000000000
1	0000000000000001







ここから機械語
001001 00000 01010 0000000000000000	// s : 解
001001 00000 01011 0000000000000001
001001 00000 01100 0000000000000000
001001 00000 01101 0000000000000000
001001 00000 01110 0000000000001010	// $14=10
000000 01101 01110 00100 00000 101010	// slt $13 $14 $a0
000100 00100 00000 0000000000000101		// rs==rt -> jumpto(pc+4+Imm*4)
001001 01101 01101 0000000000000001		// i++
000000 01010 00000 01100 00000 100001
000000 01010 01011 01010 00000 100001
000000 01100 00000 01011 00000 100001
000010 00000000000000000000000110
001001 00010 01010 0000000000000000

ここから下は機械語基準
<00>	addiu	$zero $10 0		s=0	// rs rt imm
		addiu	$zero $11 1		a=1
		addiu	$zero $12 0		b=0
		addiu	$zero $13 0		i=0
		addiu	$zero $14 10	N=10
	
		slt		$14 $13	$a0		i($13) < n($14) -> $a0 = 1
		beq  	$14 $zero exit	exit = 12
		addiu	$13 $13 1		i++
		(ここからの計算内容:temp=s/s=s+a/a=temp)
		addu 	$10 $zero $12	b=s
		// rd = rs+rt : addu rs,rt,rd
		addu	$10 $10 $11		s=s+a
<10>	addu	$11 $12 $zero	a=b	
		j		5				pc=imm
		addiu	$v0 $10	0	

















